/**
 * Created by 666 on 2017/10/12.
 */
export default {
  //中文姓名
  regCheckCnName: /^([\u4E00-\u9FA5\uF900-\uFA2D\.]){2,30}$/,
  //英文姓名
  regCheckEnName: /^([a-zA-Z\.\s]){2,45}$/,
  //公司
  regCheckComName: /^([\u4E00-\u9FA5\uF900-\uFA2D]|[a-zA-Z\d\s\.\,\'\_\(\)\（\）\-]){4,50}$/,
  //职务
  regCheckRank: /^[\/\.\,\sa-zA-Z\u4e00-\u9fa5\uF900-\uFA2D]{2,50}$/,
  //部门
  regCheckDepar: /^([\u4E00-\u9FA5\uF900-\uFA2D]|[a-zA-Z\s\（\）\(\)\/\-]){2,50}$/,
  //手机
  regCheckCnMobile: /^1(3[0-9]|5[0-9]|8[0-9]|4[0-9]|7[0-9]|66|9[8-9])\d{8}$/,
  //手机英文
  regCheckEnMobile: /^[0-9]{5,20}$/,

  //邮箱
  regCheckEmail: /^([a-zA-Z0-9]+[_|\_|\.|\-]?)*[a-zA-Z0-9]+@([a-zA-Z0-9-]+[_|\_|\.]?)*[a-zA-Z0-9]+\.[a-zA-Z]{2,4}$/,
  //国内邮编
  checkCnZipCode: /^[0-9]{6}$/,
  //港澳台邮编
  checkgatZipCode: /^[0-9]{5,6}$/,
  //国外邮编
  checkEnZipCode: /^[0-9a-zA-Z]{3,}$/,
  //地址  6-100字符
  checkAddress: /^.{6,45}$/,
  //国内电话、传真
  regCheckTelCn: /^([0-9]{1,4}[-]){1}([0-9]{1,4}[-]){1}([0-9]{7,8})([-][0-9]{0,5}){0,1}$/,
  //国外电话、传真
  regCheckTelEn: /^([0-9]{1,4}[-]){1}([1-9][0-9]{5,11})([-][0-9]{0,6}){0,1}$/,
  //网址
  regWebUrl: /^([hH][tT]{2}[pP]:\/\/|[hH][tT]{2}[pP][sS]:\/\/){0,1}(([A-Za-z0-9-~]+)\.)+(([A-Za-z0-9-~]+)\.)+([A-Za-z0-9-~\/])+$/,
  //身份证
  regId1:/^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/,
  regId2:/^[1-9]\d{5}\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{2}$/,
  regId3:/^[0-9a-zA-Z]{6,}$/,
}
